第5章 数据聚合与组内运算

5.2 通过groupby()方法拆分数据

In [21]:
import pandas as pd
df = pd.DataFrame({"Key":['C','B','C','A','B','B','A','C','A'],
                   "Data":[2,4,6,8,10,1,14,16,18]})
df

   Data Key
0     2   C
1     4   B
2     6   C
3     8   A
4    10   B
5     1   B
6    14   A
7    16   C
8    18   A

In [22]:
# 按Key列进行分组，使用列索引字段分组
df.groupby(by='Key')

In [23]:
group_obj=df.groupby(by='Key')

In [24]:
#遍历
for item in group_obj:
    print(item)

('A',    Data Key
3     8   A
6    14   A
8    18   A)
('B',    Data Key
1     4   B
4    10   B
5     1   B)
('C',    Data Key
0     2   C
2     6   C
7    16   C)

In [25]:
#通过series对象分组
df = pd.DataFrame({'key1': ['A', 'A', 'B', 'B', 'A'],
                   'key2': ['one', 'two', 'one', 'two', 'one'],
                   'data1': [2, 3, 4, 6, 8],
                   'data2': [3, 5, 6, 3, 7]})
df

   data1  data2 key1 key2
0      2      3    A  one
1      3      5    A  two
2      4      6    B  one
3      6      3    B  two
4      8      7    A  one

In [26]:
se = pd.Series(['a', 'b', 'a', 'c', 'b'])
se

0    a
1    b
2    a
3    c
4    b
dtype: object

In [27]:
group_obj=df.groupby(by=se)

In [28]:
group_obj

In [29]:
for item in group_obj:
    print(item)    
    #根据se:['a', 'b', 'a', 'c', 'b']   'a' 'a'对应着0，2下标，'b''b'对应着1，4下标，所以df对象中的 02分为一组，14分为一组，3分为一组

('a',    data1  data2 key1 key2
0      2      3    A  one
2      4      6    B  one)
('b',    data1  data2 key1 key2
1      3      5    A  two
4      8      7    A  one)
('c',    data1  data2 key1 key2
3      6      3    B  two)

In [31]:
# 当Series长度与原数据的索引值长度不同时，只给了3个se对象元素，只会对前3行数据进行分组
se = pd.Series(['a', 'a', 'b'])
group_obj = df.groupby(se)
for i in group_obj:           # 遍历分组对象
    print(i)

('a',    data1  data2 key1 key2
0      2      3    A  one
1      3      5    A  two)
('b',    data1  data2 key1 key2
2      4      6    B  one)

In [32]:
num_df =pd.DataFrame({'a': [1, 2, 3, 4, 5],
                    'b': [6, 7, 8, 9, 10],
                    'c': [11, 12, 13, 14, 15],
                    'd': [5, 4, 3, 2, 1],
                    'e': [10, 9, 8, 7, 6]})
num_df

   a   b   c  d   e
0  1   6  11  5  10
1  2   7  12  4   9
2  3   8  13  3   8
3  4   9  14  2   7
4  5  10  15  1   6

In [33]:
# 定义分组关系
mapping = {'a':'第一组','b':'第二组','c':'第一组', 'd':'第三组','e':'第二组'}
mapping

{'a': '第一组', 'b': '第二组', 'c': '第一组', 'd': '第三组', 'e': '第二组'}

In [34]:
ret=num_df.groupby(by=mapping,axis=1)

In [35]:
for item in ret:
    print(item)

('第一组',    a   c
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15)
('第三组',    d
0  5
1  4
2  3
3  2
4  1)
('第二组',     b   e
0   6  10
1   7   9
2   8   8
3   9   7
4  10   6)

In [36]:
df = pd.DataFrame({'a': [1, 2, 3, 4, 5],
                   'b': [6, 7, 8, 9, 10],
                   'c': [5, 4, 3, 2, 1]},
                  index=['Sun', 'Jack', 'Alice', 'Helen', 'Job'])
df

       a   b  c
Sun    1   6  5
Jack   2   7  4
Alice  3   8  3
Helen  4   9  2
Job    5  10  1

In [26]:
groupby_obj = df.groupby(len)     
# 使用内置函数len进行分组,len——求行字段长度，'sum' 'job'都是长度为3；'jack'长度为4；'alice' 'helen'长度为5

In [27]:
for group in groupby_obj:        # 遍历分组对象
    print(group)

(3,      a   b  c
Sun  1   6  5
Job  5  10  1)
(4,       a  b  c
Jack  2  7  4)
(5,        a  b  c
Alice  3  8  3
Helen  4  9  2)

5.3 数据聚合

5.3.1 使用内置统计方法聚合数据

In [37]:
import numpy as np
df = pd.DataFrame({'key1': ['A', 'A', 'B', 'B', 'A'],
                   'key2': ['one', 'two', 'one', 'two', 'one'],
                   "data1": [2, 3, 4, 6, 8],
                   "data2": [3, 5, np.nan, 3,7]})
df

   data1  data2 key1 key2
0      2    3.0    A  one
1      3    5.0    A  two
2      4    NaN    B  one
3      6    3.0    B  two
4      8    7.0    A  one

In [31]:
df.groupby(by='key1').mean()   # 按key1进行分组，求每个分组的平均值

         data1  data2
key1
A     4.333333    5.0
B     5.000000    3.0

5.3.2 面向列的聚合方法（agg）

In [33]:
from pandas import DataFrame, Series
data_frame = pd.DataFrame(np.arange(36).reshape((6, 6)),columns=list('abcdef'))
data_frame['key'] = Series(list('aaabbb'), name='key')   #新增的列索引
data_frame

    a   b   c   d   e   f key
0   0   1   2   3   4   5   a
1   6   7   8   9  10  11   a
2  12  13  14  15  16  17   a
3  18  19  20  21  22  23   b
4  24  25  26  27  28  29   b
5  30  31  32  33  34  35   b

In [34]:
# 按key列进行分组
data_group = data_frame.groupby('key')

In [35]:
data_frame.iloc[:3]  #获取前三行数据

    a   b   c   d   e   f key
0   0   1   2   3   4   5   a
1   6   7   8   9  10  11   a
2  12  13  14  15  16  17   a

In [36]:
data_group.groups

{'a': [0, 1, 2], 'b': [3, 4, 5]}

In [37]:
data_group.groups['a']    #获取的是’a'这一组的行索引的名称

Int64Index([0, 1, 2], dtype='int64')

In [38]:
data_frame[data_group.groups['a']]    #会出现错误，因为不允许直接先取行索引操作

KeyError: "None of [Int64Index([0, 1, 2], dtype='int64')] are in the [columns]"

In [39]:
data_frame.iloc[data_group.groups['a']]    #正确

    a   b   c   d   e   f key
0   0   1   2   3   4   5   a
1   6   7   8   9  10  11   a
2  12  13  14  15  16  17   a

In [40]:
data_frame.iloc[data_group.groups['b']]    #正确

    a   b   c   d   e   f key
3  18  19  20  21  22  23   b
4  24  25  26  27  28  29   b
5  30  31  32  33  34  35   b

In [41]:
# 求每个分组的和
data_group.agg(sum)

      a   b   c   d   e   f
key
a    18  21  24  27  30  33
b    72  75  78  81  84  87

In [42]:
#求极差值,定义一个函数 range_data_group
def range_data_group(arr):
    return arr.max()-arr.min()

In [44]:
data_group.agg(range_data_group)    
#a组中12-0，13-1，14-2......17-5 结果都是12；b组中30-18，31-19，32-20......35-23结果都是12；故极差值都是12

      a   b   c   d   e   f
key
a    12  12  12  12  12  12
b    12  12  12  12  12  12

In [45]:
data_group.agg([range_data_group,sum])    #同时传多个函数进去，对一列数据用两种函数聚合

                   a                    b                    c      \
    range_data_group sum range_data_group sum range_data_group sum
key
a                 12  18               12  21               12  24
b                 12  72               12  75               12  78

                   d                    e                    f
    range_data_group sum range_data_group sum range_data_group sum
key
a                 12  27               12  30               12  33
b                 12  81               12  84               12  87

In [46]:
data_group.agg([("极差值", range_data_group), ("求和", sum)])

      a       b       c       d       e       f
    极差值  求和 极差值  求和 极差值  求和 极差值  求和 极差值  求和 极差值  求和
key
a    12  18  12  21  12  24  12  27  12  30  12  33
b    12  72  12  75  12  78  12  81  12  84  12  87

In [48]:
# 每列(a列,b列,c列)使用不同的函数聚合分组数据
data_group.agg({'a': 'sum', 'b': 'max', 'c': range_data_group})

      a   b   c
key
a    18  13  12
b    72  31  12

5.4 其它分组级运算

5.4.1 数据转型（transform）

In [49]:
import pandas as pd
df = pd.DataFrame({'a': [0, 1, 6, 10, 3],
                   'b': [1, 2, 7, 11, 4],
                   'c': [2, 3, 8, 12, 4],
                   'd': [3, 4, 9, 13, 5],
                   'e': [4, 5, 10, 14, 3],
                   'key': ['A', 'A', 'B', 'B', 'B']})
df

    a   b   c   d   e key
0   0   1   2   3   4   A
1   1   2   3   4   5   A
2   6   7   8   9  10   B
3  10  11  12  13  14   B
4   3   4   4   5   3   B

In [52]:
data_group = df.groupby('key').transform('mean')
data_group

          a         b    c    d    e
0  0.500000  1.500000  2.5  3.5  4.5
1  0.500000  1.500000  2.5  3.5  4.5
2  6.333333  7.333333  8.0  9.0  9.0
3  6.333333  7.333333  8.0  9.0  9.0
4  6.333333  7.333333  8.0  9.0  9.0

In [53]:
df = pd.DataFrame({'A': [2, 3, 3, 4, 2],
                   'B': [4, 2, 3, 6, 6],
                   'C': [9, 7, 0, 7, 8],
                   'D': [3, 4, 8, 6, 10]})
df

   A  B  C   D
0  2  4  9   3
1  3  2  7   4
2  3  3  0   8
3  4  6  7   6
4  2  6  8  10

In [54]:
# 以key为分组依据，对df对象进行分组
key = ['one','one','two',' two',' two']
df.groupby(by=key).transform("mean")
#0，1 的均值是一样的，为何2，3，4的均值2与3，4不一样呢？？？

     A    B    C    D
0  2.5  3.0  8.0  3.5
1  2.5  3.0  8.0  3.5
2  3.0  3.0  0.0  8.0
3  3.0  6.0  7.5  8.0
4  3.0  6.0  7.5  8.0

5.4.2 数据应用（apply）

In [56]:
data_frame = DataFrame({'data1': [80,23,25,63,94,92,99,92,82,99],
                        'data2': [41,87,58,68,72,89,60,42,53,65],
                        'data3': [30,78,23,66,16,59,20,23,24,40]})
data_frame

   data1  data2  data3
0     80     41     30
1     23     87     78
2     25     58     23
3     63     68     66
4     94     72     16
5     92     89     59
6     99     60     20
7     92     42     23
8     82     53     24
9     99     65     40

In [57]:
data_frame.apply(lambda x:x.max()-x.min())   #默认作用在列上进行运算

data1    76
data2    48
data3    62
dtype: int64

In [58]:
data_frame.apply(lambda x:x.max()-x.min(),axis=1)   #参数axis=1 ,作用在行上进行运算

0    50
1    64
2    35
3     5
4    78
5    33
6    79
7    69
8    58
9    59
dtype: int64

In [60]:
data_frame2 = DataFrame({'data1': [80,23,25,63,94,92,99,92,82,99],
                        'data2': [41,87,58,68,72,89,60,42,53,65],
                        'data3': [30,78,23,66,16,59,20,23,24,40],
                        'key': list('baabbabaaa')})
data_frame2

   data1  data2  data3 key
0     80     41     30   b
1     23     87     78   a
2     25     58     23   a
3     63     68     66   b
4     94     72     16   b
5     92     89     59   a
6     99     60     20   b
7     92     42     23   a
8     82     53     24   a
9     99     65     40   a

In [61]:
# 对数据进行分组
data_by_group = data_frame2.groupby('key')
# 打印分组数据
dict([x for x in data_by_group])['a']

   data1  data2  data3 key
1     23     87     78   a
2     25     58     23   a
5     92     89     59   a
7     92     42     23   a
8     82     53     24   a
9     99     65     40   a

In [62]:
dict([x for x in data_by_group])['b']

   data1  data2  data3 key
0     80     41     30   b
3     63     68     66   b
4     94     72     16   b
6     99     60     20   b

In [63]:
# 调用apply()方法聚合，求每个分组中的最大值
data_by_group.apply(max)

     data1  data2  data3 key
key
a       99     89     78   a
b       99     72     66   b